                                                   млллпппппллллм
                                                  ллп         лллм
                                                 мл            плллм
                                                млп              плллм
                                        м      лл
                                       лл      лл
лллллллллллллллллллллллллллллллллллллл ллмппл лллмпллллллллллллпппппмммммл
пппппппппппппппппплппппппппплппппппппп плллмм пллл ппппппммммммллллппппп
 млм          мллллллмлл   лл           пппплллллллллллллппппп     мллм       мммлммлмм
 ллл          ллплллллллл  ллм                ллл                 лллллм    ллллллллллл
 плллммлллл   ллллллллллл  лллммлллм           лл                 ллп лл    лллппллпллл
  плллллпллл  лллл лллллп   ллллпллл           ллл               ллл  ллм   ллл  лл  лл
   лллл  ллл   плл   лл     лллл  лл   мм       ллм              ллл  ллл   ллп  лл  лл
  ллплл  ллл   млл   лл    млллл  ллп лл        плл              ллл  ллл   лл   лл  лл
  лпмл   лллл  ллм   лл    ллллл  ллл ллм        ллм             ллл  ллл   лл   лл  лл
 ллмл    лллл  ллп   лл    ллл    ллл плллллмммммлллммллллллллп  ллл  ллл   лл   лл  лл
 лллл   млллп  лл    лл    лллммммллп    пппппппппллппппп       ллллм ллл  млл   лл  ллмм
 ллллллллллл   лл    лл    лллллллллл             лл            ллллл ллл лллл   лл  ллллл
  ллл   лллл   лл    лл    лллм пллл              ллл           ллллл ллл лллп   лл   лллл
  лллл   ллл   лл    лл     ллп  лллм             лл            лллл  ллл плл    лл   плл
   ллл   ллл   лл    лл     ллл  пллл             лл             ллл  ллл        лл
   ллл   ллл   ллл   лл     ллл   лл              лл             ллл  ллл        лл
   ллл   ллл   ллл   лллл    лл   лл          ммммллмм           ллл  ллл      м лл м
м  ллл м ллл   лллм млллллл  ллмм лл      ммлллппплплллллмм      ллл  ллл     лл лл лл
лм ллллл ллл   плллмллллллл млллл ллм   млппп    лл   ппплллм    ллл  ллл     ллмллмлл
лл ллллл лллллм лллллллллллмллпллллллл млп      мл        плллм   лллллп       лллллллл
ллллп  п лллллп  лллп ллп лллп пллпплл лп      мл           плллм  пллп         пллллп
ммммммммммммммммммлллмммммммлммммммммм лл ммммм лл ммммммммммммпллл ммммммммммммммммммммммммммммммммм
лллллллллллллллллллллллллллллллллллллл лл лллпмллпмлллллллллллллмммллллллллллллллллллллллллллллллллл
лллллллллллллллллллллллллллллллллллллллмплмпмллпмлллллллллллллллллллллллллллллллллллллллллллллллллллл
                                          пппп